
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12747647447)


<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_lb.internal
  * aws_lb_listener.internal
  * aws_lb_target_group.backend_blue
  * aws_lb_target_group.backend_green
  * aws_security_group.this[&#34;backend&#34;]
  * aws_security_group.this[&#34;frontend&#34;]
  * aws_security_group.this[&#34;internal&#34;]
  * aws_vpc_security_group_ingress_rule.internal


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lb.internal will be created
  + resource "aws_lb" "internal" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "internal"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-05aa4a97e1269ae69",
          + "subnet-08a3b7f0e72fcf46d",
        ]
      + tags_all                                                     = {
          + "Managed" = "Terraform"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.internal will be created
  + resource "aws_lb_listener" "internal" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 80
      + protocol                 = "HTTP"
      + ssl_policy               = (known after apply)
      + tags_all                 = {
          + "Managed" = "Terraform"
        }
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.backend_blue will be created
  + resource "aws_lb_target_group" "backend_blue" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "backend-blue"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Managed" = "Terraform"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-04a61e17cecb81c94"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 15
          + matcher             = "200"
          + path                = "/healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_lb_target_group.backend_green will be created
  + resource "aws_lb_target_group" "backend_green" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "backend-green"
      + name_prefix                        = (known after apply)
      + port                               = 10080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Managed" = "Terraform"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-04a61e17cecb81c94"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 15
          + matcher             = "200"
          + path                = "/healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_security_group.this["backend"] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "backend"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "backend"
        }
      + tags_all               = {
          + "Managed" = "Terraform"
          + "Name"    = "backend"
        }
      + vpc_id                 = "vpc-04a61e17cecb81c94"
    }

  # aws_security_group.this["frontend"] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "frontend"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "frontend"
        }
      + tags_all               = {
          + "Managed" = "Terraform"
          + "Name"    = "frontend"
        }
      + vpc_id                 = "vpc-04a61e17cecb81c94"
    }

  # aws_security_group.this["internal"] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "internal"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "internal"
        }
      + tags_all               = {
          + "Managed" = "Terraform"
          + "Name"    = "internal"
        }
      + vpc_id                 = "vpc-04a61e17cecb81c94"
    }

  # aws_vpc_security_group_ingress_rule.internal will be created
  + resource "aws_vpc_security_group_ingress_rule" "internal" {
      + arn                          = (known after apply)
      + from_port                    = 80
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Managed" = "Terraform"
        }
      + to_port                      = 80
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":25,"Program":"tfcmt","SHA1":"9067730fd3d82a837e50af541a8c23fd323878c3","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->